In [10]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
df = pd.read_excel("who_suicide_statistics.xlsx")
df.to_csv("dataset.csv", sep=",")

In [5]:
data=pd.read_csv('dataset.csv')

In [6]:
data.head()

   Unnamed: 0  country  year     sex          age  suicides_no  population
0           0  Albania  1985  female  15-24 years          NaN    277900.0
1           1  Albania  1985  female  25-34 years          NaN    246800.0
2           2  Albania  1985  female  35-54 years          NaN    267500.0
3           3  Albania  1985  female   5-14 years          NaN    298300.0
4           4  Albania  1985  female  55-74 years          NaN    138700.0

In [8]:
data.drop('Unnamed: 0',axis=1,inplace=True)

In [9]:
data.head()

   country  year     sex          age  suicides_no  population
0  Albania  1985  female  15-24 years          NaN    277900.0
1  Albania  1985  female  25-34 years          NaN    246800.0
2  Albania  1985  female  35-54 years          NaN    267500.0
3  Albania  1985  female   5-14 years          NaN    298300.0
4  Albania  1985  female  55-74 years          NaN    138700.0

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43776 entries, 0 to 43775
Data columns (total 6 columns):
country        43776 non-null object
year           43776 non-null int64
sex            43776 non-null object
age            43776 non-null object
suicides_no    41520 non-null float64
population     38316 non-null float64
dtypes: float64(2), int64(1), object(3)
memory usage: 2.0+ MB

In [12]:
data.describe()

               year   suicides_no    population
count  43776.000000  41520.000000  3.831600e+04
mean    1998.502467    193.315390  1.664091e+06
std       10.338711    800.589926  3.647231e+06
min     1979.000000      0.000000  2.590000e+02
25%     1990.000000      1.000000  8.511275e+04
50%     1999.000000     14.000000  3.806550e+05
75%     2007.000000     91.000000  1.305698e+06
max     2016.000000  22338.000000  4.380521e+07

In [13]:
data.describe(include='object')

       country     sex          age
count    43776   43776        43776
unique     141       2            6
top     Israel  female  55-74 years
freq       456   21888         7296